from numpy import linalg as l
import numpy as np

'''
L = numpy.linalg.cholesky(a) 
返回正定矩阵 a 的 Cholesky 分解 a = L*L.T ，其中 L 是下三角。
'''

A = np.array([[1, 1, 1, 1], [1, 3, 3, 3],
[1, 3, 5, 5], [1, 3, 5, 7]])
print(A)
# [[1 1 1 1]
# [1 3 3 3]
# [1 3 5 5]
# [1 3 5 7]]



'\n\n'
print('\n返回特征值\n',l.eigvals(A))#返回特征值
# [13.13707118 1.6199144 0.51978306 0.72323135]

print('\n打印第一个特征向量\n',l.eig(A)[1])#先打印特征值 然后是特征向量
# array([1., 2., 3.])
# array([[1., 0., 0.],
#        [0., 1., 0.],
#        [0., 0., 1.]])
L=l.cholesky(A)
print('\n打印cholesky分解后的下三角矩阵\n',L)
'''
 [[1.         0.         0.         0.        ]
 [1.         1.41421356 0.         0.        ]
 [1.         1.41421356 1.41421356 0.        ]
 [1.         1.41421356 1.41421356 1.41421356]]
'''
print(np.dot(L, L.T))
# [[1. 1. 1. 1.]
# [1. 3. 3. 3.]
# [1. 3. 5. 5.]
# [1. 3. 5. 7.]]

